ZhVladimir89/uos-embedded/sources/runtime/cortex-m/io-stm32f1.h
#ifdef STM32F10X_XL
    ADC1_2_IRQn                 = 18,     /*!< ADC1 and ADC2 global Interrupt                       */
    USB_HP_CAN1_TX_IRQn         = 19,     /*!< USB Device High Priority or CAN1 TX Interrupts       */
    USB_LP_CAN1_RX0_IRQn        = 20,     /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
    CAN1_RX1_IRQn               = 21,     /*!< CAN1 RX1 Interrupt                                   */
    CAN1_SCE_IRQn               = 22,     /*!< CAN1 SCE Interrupt                                   */
    EXTI9_5_IRQn                = 23,     /*!< External Line[9:5] Interrupts                        */
    TIM1_BRK_TIM9_IRQn          = 24,     /*!< TIM1 Break Interrupt and TIM9 global Interrupt       */
    TIM1_UP_TIM10_IRQn          = 25,     /*!< TIM1 Update Interrupt and TIM10 global Interrupt     */
    TIM1_TRG_COM_TIM11_IRQn     = 26,     /*!< TIM1 Trigger and Commutation Interrupt and TIM11 global interrupt */
    TIM1_CC_IRQn                = 27,     /*!< TIM1 Capture Compare Interrupt                       */
    TIM2_IRQn                   = 28,     /*!< TIM2 global Interrupt                                */
    TIM3_IRQn                   = 29,     /*!< TIM3 global Interrupt                                */
    TIM4_IRQn                   = 30,     /*!< TIM4 global Interrupt                                */
    I2C1_EV_IRQn                = 31,     /*!< I2C1 Event Interrupt                                 */
    I2C1_ER_IRQn                = 32,     /*!< I2C1 Error Interrupt                                 */
    I2C2_EV_IRQn                = 33,     /*!< I2C2 Event Interrupt                                 */
    I2C2_ER_IRQn                = 34,     /*!< I2C2 Error Interrupt                                 */
    SPI1_IRQn                   = 35,     /*!< SPI1 global Interrupt                                */
    SPI2_IRQn                   = 36,     /*!< SPI2 global Interrupt                                */
    USART1_IRQn                 = 37,     /*!< USART1 global Interrupt                              */
    USART2_IRQn                 = 38,     /*!< USART2 global Interrupt                              */
    USART3_IRQn                 = 39,     /*!< USART3 global Interrupt                              */
    EXTI15_10_IRQn              = 40,     /*!< External Line[15:10] Interrupts                      */
    RTCAlarm_IRQn               = 41,     /*!< RTC Alarm through EXTI Line Interrupt                */
    USBWakeUp_IRQn              = 42,     /*!< USB Device WakeUp from suspend through EXTI Line Interrupt */
    TIM8_BRK_TIM12_IRQn         = 43,     /*!< TIM8 Break Interrupt and TIM12 global Interrupt      */
    TIM8_UP_TIM13_IRQn          = 44,     /*!< TIM8 Update Interrupt and TIM13 global Interrupt     */
    TIM8_TRG_COM_TIM14_IRQn     = 45,     /*!< TIM8 Trigger and Commutation Interrupt and TIM14 global interrupt */
    TIM8_CC_IRQn                = 46,     /*!< TIM8 Capture Compare Interrupt                       */
    ADC3_IRQn                   = 47,     /*!< ADC3 global Interrupt                                */
    FSMC_IRQn                   = 48,     /*!< FSMC global Interrupt                                */
    SDIO_IRQn                   = 49,     /*!< SDIO global Interrupt                                */
    TIM5_IRQn                   = 50,     /*!< TIM5 global Interrupt                                */
    SPI3_IRQn                   = 51,     /*!< SPI3 global Interrupt                                */
    UART4_IRQn                  = 52,     /*!< UART4 global Interrupt                               */
    UART5_IRQn                  = 53,     /*!< UART5 global Interrupt                               */
    TIM6_IRQn                   = 54,     /*!< TIM6 global Interrupt                                */
    TIM7_IRQn                   = 55,     /*!< TIM7 global Interrupt                                */
    DMA2_Channel1_IRQn          = 56,     /*!< DMA2 Channel 1 global Interrupt                      */
    DMA2_Channel2_IRQn          = 57,     /*!< DMA2 Channel 2 global Interrupt                      */
    DMA2_Channel3_IRQn          = 58,     /*!< DMA2 Channel 3 global Interrupt                      */
    DMA2_Channel4_5_IRQn        = 59,     /*!< DMA2 Channel 4 and Channel 5 global Interrupt        */
#endif /* STM32F10X_XL */

#ifdef STM32F10X_CL
    ADC1_2_IRQn                 = 18,     /*!< ADC1 and ADC2 global Interrupt                       */
    CAN1_TX_IRQn                = 19,     /*!< USB Device High Priority or CAN1 TX Interrupts       */
    CAN1_RX0_IRQn               = 20,     /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
    CAN1_RX1_IRQn               = 21,     /*!< CAN1 RX1 Interrupt                                   */
    CAN1_SCE_IRQn               = 22,     /*!< CAN1 SCE Interrupt                                   */
    EXTI9_5_IRQn                = 23,     /*!< External Line[9:5] Interrupts                        */
    TIM1_BRK_IRQn               = 24,     /*!< TIM1 Break Interrupt                                 */
    TIM1_UP_IRQn                = 25,     /*!< TIM1 Update Interrupt                                */
    TIM1_TRG_COM_IRQn           = 26,     /*!< TIM1 Trigger and Commutation Interrupt               */
    TIM1_CC_IRQn                = 27,     /*!< TIM1 Capture Compare Interrupt                       */
    TIM2_IRQn                   = 28,     /*!< TIM2 global Interrupt                                */
    TIM3_IRQn                   = 29,     /*!< TIM3 global Interrupt                                */
    TIM4_IRQn                   = 30,     /*!< TIM4 global Interrupt                                */
    I2C1_EV_IRQn                = 31,     /*!< I2C1 Event Interrupt                                 */
    I2C1_ER_IRQn                = 32,     /*!< I2C1 Error Interrupt                                 */
    I2C2_EV_IRQn                = 33,     /*!< I2C2 Event Interrupt                                 */
    I2C2_ER_IRQn                = 34,     /*!< I2C2 Error Interrupt                                 */
    SPI1_IRQn                   = 35,     /*!< SPI1 global Interrupt                                */
    SPI2_IRQn                   = 36,     /*!< SPI2 global Interrupt                                */
    USART1_IRQn                 = 37,     /*!< USART1 global Interrupt                              */
    USART2_IRQn                 = 38,     /*!< USART2 global Interrupt                              */
    USART3_IRQn                 = 39,     /*!< USART3 global Interrupt                              */
    EXTI15_10_IRQn              = 40,     /*!< External Line[15:10] Interrupts                      */
    RTCAlarm_IRQn               = 41,     /*!< RTC Alarm through EXTI Line Interrupt                */
    OTG_FS_WKUP_IRQn            = 42,     /*!< USB OTG FS WakeUp from suspend through EXTI Line Interrupt */
    TIM5_IRQn                   = 50,     /*!< TIM5 global Interrupt                                */
    SPI3_IRQn                   = 51,     /*!< SPI3 global Interrupt                                */
    UART4_IRQn                  = 52,     /*!< UART4 global Interrupt                               */
    UART5_IRQn                  = 53,     /*!< UART5 global Interrupt                               */
    TIM6_IRQn                   = 54,     /*!< TIM6 global Interrupt                                */
    TIM7_IRQn                   = 55,     /*!< TIM7 global Interrupt                                */
    DMA2_Channel1_IRQn          = 56,     /*!< DMA2 Channel 1 global Interrupt                      */
    DMA2_Channel2_IRQn          = 57,     /*!< DMA2 Channel 2 global Interrupt                      */
    DMA2_Channel3_IRQn          = 58,     /*!< DMA2 Channel 3 global Interrupt                      */
    DMA2_Channel4_IRQn          = 59,     /*!< DMA2 Channel 4 global Interrupt                      */
    DMA2_Channel5_IRQn          = 60,     /*!< DMA2 Channel 5 global Interrupt                      */
    ETH_IRQn                    = 61,     /*!< Ethernet global Interrupt                            */
    ETH_WKUP_IRQn               = 62,     /*!< Ethernet Wakeup through EXTI line Interrupt          */
    CAN2_TX_IRQn                = 63,     /*!< CAN2 TX Interrupt                                    */
    CAN2_RX0_IRQn               = 64,     /*!< CAN2 RX0 Interrupt                                   */
    CAN2_RX1_IRQn               = 65,     /*!< CAN2 RX1 Interrupt                                   */
    CAN2_SCE_IRQn               = 66,     /*!< CAN2 SCE Interrupt                                   */
    OTG_FS_IRQn                 = 67,     /*!< USB OTG FS global Interrupt                          */
#endif /* STM32F10X_CL */
    ARCH_TIMER_IRQ,                       /* Internal system number for mutex */
    ARCH_INTERRUPTS                       /* FIXME check it*/
} IRQn_Type;

typedef struct
{
    arm_reg_t SR;
    arm_reg_t CR1;
    arm_reg_t CR2;
    arm_reg_t SMPR1;
    arm_reg_t SMPR2;
    arm_reg_t JOFR1;
    arm_reg_t JOFR2;
    arm_reg_t JOFR3;
    arm_reg_t JOFR4;
    arm_reg_t HTR;
    arm_reg_t LTR;
    arm_reg_t SQR1;
    arm_reg_t SQR2;
    arm_reg_t SQR3;
    arm_reg_t JSQR;
    arm_reg_t JDR1;
    arm_reg_t JDR2;
    arm_reg_t JDR3;
    arm_reg_t JDR4;
    arm_reg_t DR;
} ADC_t;

typedef struct
{
    arm_reg_t  RESERVED0;
    volatile uint16_t DR1;
    uint16_t  RESERVED1;
    volatile uint16_t DR2;
    uint16_t  RESERVED2;
    volatile uint16_t DR3;
    uint16_t  RESERVED3;
    volatile uint16_t DR4;
    uint16_t  RESERVED4;
    volatile uint16_t DR5;
    uint16_t  RESERVED5;
    volatile uint16_t DR6;
    uint16_t  RESERVED6;
    volatile uint16_t DR7;
    uint16_t  RESERVED7;
    volatile uint16_t DR8;
    uint16_t  RESERVED8;
    volatile uint16_t DR9;
    uint16_t  RESERVED9;
    volatile uint16_t DR10;
    uint16_t  RESERVED10;
    volatile uint16_t RTCCR;
    uint16_t  RESERVED11;
    volatile uint16_t CR;
    uint16_t  RESERVED12;
    volatile uint16_t CSR;
    uint16_t  RESERVED13[5];
    volatile uint16_t DR11;
    uint16_t  RESERVED14;
    volatile uint16_t DR12;
    uint16_t  RESERVED15;
    volatile uint16_t DR13;
    uint16_t  RESERVED16;
    volatile uint16_t DR14;
    uint16_t  RESERVED17;
    volatile uint16_t DR15;
    uint16_t  RESERVED18;
    volatile uint16_t DR16;
    uint16_t  RESERVED19;
    volatile uint16_t DR17;
    uint16_t  RESERVED20;
    volatile uint16_t DR18;
    uint16_t  RESERVED21;
    volatile uint16_t DR19;
    uint16_t  RESERVED22;
    volatile uint16_t DR20;
    uint16_t  RESERVED23;
    volatile uint16_t DR21;
    uint16_t  RESERVED24;
    volatile uint16_t DR22;
    uint16_t  RESERVED25;
    volatile uint16_t DR23;
    uint16_t  RESERVED26;
    volatile uint16_t DR24;
    uint16_t  RESERVED27;
    volatile uint16_t DR25;
    uint16_t  RESERVED28;
    volatile uint16_t DR26;
    uint16_t  RESERVED29;
    volatile uint16_t DR27;
    uint16_t  RESERVED30;
    volatile uint16_t DR28;
    uint16_t  RESERVED31;
    volatile uint16_t DR29;
    uint16_t  RESERVED32;
    volatile uint16_t DR30;
    uint16_t  RESERVED33;
    volatile uint16_t DR31;
    uint16_t  RESERVED34;
    volatile uint16_t DR32;
    uint16_t  RESERVED35;
    volatile uint16_t DR33;
    uint16_t  RESERVED36;
    volatile uint16_t DR34;
    uint16_t  RESERVED37;
    volatile uint16_t DR35;
    uint16_t  RESERVED38;
    volatile uint16_t DR36;
    uint16_t  RESERVED39;
    volatile uint16_t DR37;
    uint16_t  RESERVED40;
    volatile uint16_t DR38;
    uint16_t  RESERVED41;
    volatile uint16_t DR39;
    uint16_t  RESERVED42;
    volatile uint16_t DR40;
    uint16_t  RESERVED43;
    volatile uint16_t DR41;
    uint16_t  RESERVED44;
    volatile uint16_t DR42;
    uint16_t  RESERVED45;
} BKP_t;

typedef struct
{
    arm_reg_t TIR;
    arm_reg_t TDTR;
    arm_reg_t TDLR;
    arm_reg_t TDHR;
} CAN_TxMailBox_t;

typedef struct
{
    arm_reg_t RIR;
    arm_reg_t RDTR;
    arm_reg_t RDLR;
    arm_reg_t RDHR;
} CAN_FIFOMailBox_t;

typedef struct
{
    arm_reg_t FR1;
    arm_reg_t FR2;
} CAN_FilterRegister_t;

typedef struct
{
    arm_reg_t MCR;
    arm_reg_t MSR;
    arm_reg_t TSR;
    arm_reg_t RF0R;
    arm_reg_t RF1R;
    arm_reg_t IER;
    arm_reg_t ESR;
    arm_reg_t BTR;
    arm_reg_t RESERVED0[88];
    CAN_TxMailBox_t   sTxMailBox[3];
    CAN_FIFOMailBox_t sFIFOMailBox[2];
    arm_reg_t RESERVED1[12];
    arm_reg_t FMR;
    arm_reg_t FM1R;
    arm_reg_t RESERVED2;
    arm_reg_t FS1R;
    arm_reg_t RESERVED3;
    arm_reg_t FFA1R;
    arm_reg_t RESERVED4;
    arm_reg_t FA1R;
    arm_reg_t RESERVED5[8];
#ifndef STM32F10X_CL
    CAN_FilterRegister_t sFilterRegister[14];
#else
    CAN_FilterRegister_t sFilterRegister[28];
#endif /* STM32F10X_CL */
} CAN_t;

typedef struct
{
    arm_reg_t CFGR;
    arm_reg_t OAR;
    arm_reg_t PRES;
    arm_reg_t ESR;
    arm_reg_t CSR;
    arm_reg_t TXD;
    arm_reg_t RXD;
} CEC_t;

typedef struct
{
    arm_reg_t     DR;
    volatile uint8_t  IDR;
    uint8_t       RESERVED0;
    uint16_t      RESERVED1;
    arm_reg_t     CR;
} CRC_t;

typedef struct
{
    arm_reg_t CR;
    arm_reg_t SWTRIGR;
    arm_reg_t DHR12R1;
    arm_reg_t DHR12L1;
    arm_reg_t DHR8R1;
    arm_reg_t DHR12R2;
    arm_reg_t DHR12L2;
    arm_reg_t DHR8R2;
    arm_reg_t DHR12RD;
    arm_reg_t DHR12LD;
    arm_reg_t DHR8RD;
    arm_reg_t DOR1;
    arm_reg_t DOR2;
#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
    arm_reg_t SR;
#endif
} DAC_t;

typedef struct
{
    arm_reg_t IDCODE;
    arm_reg_t CR;
} DBGMCU_t;

typedef struct
{
    arm_reg_t CR;    // Configuration
    arm_reg_t NDTR;  // Number of data
    arm_reg_t PAR;   // Peripheral address
    arm_reg_t MAR;   // Memory address
} DMA_STREAM_t;

typedef struct
{
    arm_reg_t ISR;   // Interrupt Status Register
    arm_reg_t IFCR;  // Interrupt Flag Clear Register
} DMA_t;

typedef struct
{
    arm_reg_t MACCR;
    arm_reg_t MACFFR;
    arm_reg_t MACHTHR;
    arm_reg_t MACHTLR;
    arm_reg_t MACMIIAR;
    arm_reg_t MACMIIDR;
    arm_reg_t MACFCR;
    arm_reg_t MACVLANTR;             /*    8 */
    arm_reg_t RESERVED0[2];
    arm_reg_t MACRWUFFR;             /*   11 */
    arm_reg_t MACPMTCSR;
    arm_reg_t RESERVED1[2];
    arm_reg_t MACSR;                 /*   15 */
    arm_reg_t MACIMR;
    arm_reg_t MACA0HR;
    arm_reg_t MACA0LR;
    arm_reg_t MACA1HR;
    arm_reg_t MACA1LR;
    arm_reg_t MACA2HR;
    arm_reg_t MACA2LR;
    arm_reg_t MACA3HR;
    arm_reg_t MACA3LR;               /*   24 */
    arm_reg_t RESERVED2[40];
    arm_reg_t MMCCR;                 /*   65 */
    arm_reg_t MMCRIR;
    arm_reg_t MMCTIR;
    arm_reg_t MMCRIMR;
    arm_reg_t MMCTIMR;               /*   69 */
    arm_reg_t RESERVED3[14];
    arm_reg_t MMCTGFSCCR;            /*   84 */
    arm_reg_t MMCTGFMSCCR;
    arm_reg_t RESERVED4[5];
    arm_reg_t MMCTGFCR;
    arm_reg_t RESERVED5[10];
    arm_reg_t MMCRFCECR;
    arm_reg_t MMCRFAECR;
    arm_reg_t RESERVED6[10];
    arm_reg_t MMCRGUFCR;
    arm_reg_t RESERVED7[334];
    arm_reg_t PTPTSCR;
    arm_reg_t PTPSSIR;
    arm_reg_t PTPTSHR;
    arm_reg_t PTPTSLR;
    arm_reg_t PTPTSHUR;
    arm_reg_t PTPTSLUR;
    arm_reg_t PTPTSAR;
    arm_reg_t PTPTTHR;
    arm_reg_t PTPTTLR;
    arm_reg_t RESERVED8[567];
    arm_reg_t DMABMR;
    arm_reg_t DMATPDR;
    arm_reg_t DMARPDR;
    arm_reg_t DMARDLAR;
    arm_reg_t DMATDLAR;
    arm_reg_t DMASR;
    arm_reg_t DMAOMR;
    arm_reg_t DMAIER;
    arm_reg_t DMAMFBOCR;
    arm_reg_t RESERVED9[9];
    arm_reg_t DMACHTDR;
    arm_reg_t DMACHRDR;
    arm_reg_t DMACHTBAR;
    arm_reg_t DMACHRBAR;
} ETH_t;

typedef struct
{
    arm_reg_t IMR;
    arm_reg_t EMR;
    arm_reg_t RTSR;
    arm_reg_t FTSR;
    arm_reg_t SWIER;
    arm_reg_t PR;
} EXTI_t;

typedef struct
{
    arm_reg_t ACR;
    arm_reg_t KEYR;
    arm_reg_t OPTKEYR;
    arm_reg_t SR;
    arm_reg_t CR;
    arm_reg_t AR;
    arm_reg_t RESERVED;
    arm_reg_t OBR;
    arm_reg_t WRPR;
#ifdef STM32F10X_XL
    arm_reg_t RESERVED1[8];
    arm_reg_t KEYR2;
    arm_reg_t RESERVED2;
    arm_reg_t SR2;
    arm_reg_t CR2;
    arm_reg_t AR2;
#endif /* STM32F10X_XL */
} FLASH_t;

typedef struct
{
    volatile uint16_t RDP;
    volatile uint16_t USER;
    volatile uint16_t Data0;
    volatile uint16_t Data1;
    volatile uint16_t WRP0;
    volatile uint16_t WRP1;
    volatile uint16_t WRP2;
    volatile uint16_t WRP3;
} OB_t;

typedef struct
{
    arm_reg_t BTCR[8];
} FSMC_Bank1_t;

typedef struct
{
    arm_reg_t BWTR[7];
} FSMC_Bank1E_t;

typedef struct
{
    arm_reg_t PCR2;
    arm_reg_t SR2;
    arm_reg_t PMEM2;
    arm_reg_t PATT2;
    arm_reg_t  RESERVED0;
    arm_reg_t ECCR2;
} FSMC_Bank2_t;

typedef struct
{
    arm_reg_t PCR3;
    arm_reg_t SR3;
    arm_reg_t PMEM3;
    arm_reg_t PATT3;
    arm_reg_t  RESERVED0;
    arm_reg_t ECCR3;
} FSMC_Bank3_t;

typedef struct
{
    arm_reg_t PCR4;
    arm_reg_t SR4;
    arm_reg_t PMEM4;
    arm_reg_t PATT4;
    arm_reg_t PIO4;
} FSMC_Bank4_t;

typedef struct
{
    arm_reg_t CRL;
    arm_reg_t CRH;
    arm_reg_t IDR;
    arm_reg_t ODR;
    arm_reg_t BSRR;
    arm_reg_t BRR;
    arm_reg_t LCKR;
} GPIO_t;

typedef struct
{
    arm_reg_t EVCR;
    arm_reg_t MAPR;
    arm_reg_t EXTICR[4];
    arm_reg_t RESERVED0;
    arm_reg_t MAPR2;
} AFIO_t;

typedef struct
{
    volatile uint16_t CR1;
    uint16_t  RESERVED0;
    volatile uint16_t CR2;
    uint16_t  RESERVED1;
    volatile uint16_t OAR1;
    uint16_t  RESERVED2;
    volatile uint16_t OAR2;
    uint16_t  RESERVED3;
    volatile uint16_t DR;
    uint16_t  RESERVED4;
    volatile uint16_t SR1;
    uint16_t  RESERVED5;
    volatile uint16_t SR2;
    uint16_t  RESERVED6;
    volatile uint16_t CCR;
    uint16_t  RESERVED7;
    volatile uint16_t TRISE;
    uint16_t  RESERVED8;
} I2C_t;

typedef struct
{
    arm_reg_t KR;
    arm_reg_t PR;
    arm_reg_t RLR;
    arm_reg_t SR;
} IWDG_t;

typedef struct
{
    arm_reg_t CR;
    arm_reg_t CSR;
} PWR_t;

typedef struct
{
    arm_reg_t CR;
    arm_reg_t CFGR;
    arm_reg_t CIR;
    arm_reg_t APB2RSTR;
    arm_reg_t APB1RSTR;
    arm_reg_t AHBENR;
    arm_reg_t APB2ENR;
    arm_reg_t APB1ENR;
    arm_reg_t BDCR;
    arm_reg_t CSR;

#ifdef STM32F10X_CL
    arm_reg_t AHBRSTR;
    arm_reg_t CFGR2;
#endif /* STM32F10X_CL */

#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
    arm_reg_t RESERVED0;
    arm_reg_t CFGR2;
#endif /* STM32F10X_LD_VL || STM32F10X_MD_VL || STM32F10X_HD_VL */
} RCC_t;

typedef struct
{
    volatile uint16_t CRH;
    uint16_t  RESERVED0;
    volatile uint16_t CRL;
    uint16_t  RESERVED1;
    volatile uint16_t PRLH;
    uint16_t  RESERVED2;
    volatile uint16_t PRLL;
    uint16_t  RESERVED3;
    volatile uint16_t DIVH;
    uint16_t  RESERVED4;
    volatile uint16_t DIVL;
    uint16_t  RESERVED5;
    volatile uint16_t CNTH;
    uint16_t  RESERVED6;
    volatile uint16_t CNTL;
    uint16_t  RESERVED7;
    volatile uint16_t ALRH;
    uint16_t  RESERVED8;
    volatile uint16_t ALRL;
    uint16_t  RESERVED9;
} RTC_t;

typedef struct
{
    arm_reg_t POWER;
    arm_reg_t CLKCR;
    arm_reg_t ARG;
    arm_reg_t CMD;
    arm_reg_t RESPCMD;
    arm_reg_t RESP1;
    arm_reg_t RESP2;
    arm_reg_t RESP3;
    arm_reg_t RESP4;
    arm_reg_t DTIMER;
    arm_reg_t DLEN;
    arm_reg_t DCTRL;
    arm_reg_t DCOUNT;
    arm_reg_t STA;
    arm_reg_t ICR;
    arm_reg_t MASK;
    arm_reg_t RESERVED0[2];
    arm_reg_t FIFOCNT;
    arm_reg_t RESERVED1[13];
    arm_reg_t FIFO;
} SDIO_t;

typedef struct
{
    volatile uint16_t CR1;
    uint16_t  RESERVED0;
    volatile uint16_t CR2;
    uint16_t  RESERVED1;
    volatile uint16_t SR;
    uint16_t  RESERVED2;
    volatile uint16_t DR;
    uint16_t  RESERVED3;
    volatile uint16_t CRCPR;
    uint16_t  RESERVED4;
    volatile uint16_t RXCRCR;
    uint16_t  RESERVED5;
    volatile uint16_t TXCRCR;
    uint16_t  RESERVED6;
    volatile uint16_t I2SCFGR;
    uint16_t  RESERVED7;
    volatile uint16_t I2SPR;
    uint16_t  RESERVED8;
} SPI_t;

typedef struct
{
    volatile uint16_t CR1;
    uint16_t  RESERVED0;
    volatile uint16_t CR2;
    uint16_t  RESERVED1;
    volatile uint16_t SMCR;
    uint16_t  RESERVED2;
    volatile uint16_t DIER;
    uint16_t  RESERVED3;
    volatile uint16_t SR;
    uint16_t  RESERVED4;
    volatile uint16_t EGR;
    uint16_t  RESERVED5;
    volatile uint16_t CCMR1;
    uint16_t  RESERVED6;
    volatile uint16_t CCMR2;
    uint16_t  RESERVED7;
    volatile uint16_t CCER;
    uint16_t  RESERVED8;
    volatile uint16_t CNT;
    uint16_t  RESERVED9;
    volatile uint16_t PSC;
    uint16_t  RESERVED10;
    volatile uint16_t ARR;
    uint16_t  RESERVED11;
    volatile uint16_t RCR;
    uint16_t  RESERVED12;
    volatile uint16_t CCR1;
    uint16_t  RESERVED13;
    volatile uint16_t CCR2;
    uint16_t  RESERVED14;
    volatile uint16_t CCR3;
    uint16_t  RESERVED15;
    volatile uint16_t CCR4;
    uint16_t  RESERVED16;
    volatile uint16_t BDTR;
    uint16_t  RESERVED17;
    volatile uint16_t DCR;
    uint16_t  RESERVED18;
    volatile uint16_t DMAR;
    uint16_t  RESERVED19;
} TIM_t;

typedef struct
{
    volatile uint16_t SR;
    uint16_t  RESERVED0;
    volatile uint16_t DR;
    uint16_t  RESERVED1;
    volatile uint16_t BRR;
    uint16_t  RESERVED2;
    volatile uint16_t CR1;
    uint16_t  RESERVED3;
    volatile uint16_t CR2;
    uint16_t  RESERVED4;
    volatile uint16_t CR3;
    uint16_t  RESERVED5;
    volatile uint16_t GTPR;
    uint16_t  RESERVED6;
} USART_t;

typedef struct
{
    arm_reg_t CR;
    arm_reg_t CFR;
    arm_reg_t SR;
} WWDG_t;

#define FLASH_BASE                           ((arm_reg_t)0x08000000) /*!< FLASH base address in the alias region */
#define ARM_SRAM_BASE                        ((arm_reg_t)0x20000000) /*!< SRAM base address in the alias region */
#define ARM_PERIPH_BASE                      ((arm_reg_t)0x40000000) /*!< Peripheral base address in the alias region */
#define ARM_SYSTEM_BASE                      ((arm_reg_t)0xE0000000) /*!< Core registers */

