ZhVladimir89/uos-embedded/sources/runtime/cortex-m/io-stm32f1.h
#define SRAM_BB_BASE                         ((arm_reg_t)0x22000000) /*!< SRAM base address in the bit-band region */
#define PERIPH_BB_BASE                       ((arm_reg_t)0x42000000) /*!< Peripheral base address in the bit-band region */

#define FSMC_R_BASE                          ((arm_reg_t)0xA0000000) /*!< FSMC registers base address */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE                      (ARM_PERIPH_BASE + 0x00000)
#define APB2PERIPH_BASE                      (ARM_PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE                       (ARM_PERIPH_BASE + 0x20000)

#define TIM2_BASE                            (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE                            (APB1PERIPH_BASE + 0x0400)
#define TIM4_BASE                            (APB1PERIPH_BASE + 0x0800)
#define TIM5_BASE                            (APB1PERIPH_BASE + 0x0C00)
#define TIM6_BASE                            (APB1PERIPH_BASE + 0x1000)
#define TIM7_BASE                            (APB1PERIPH_BASE + 0x1400)
#define TIM12_BASE                           (APB1PERIPH_BASE + 0x1800)
#define TIM13_BASE                           (APB1PERIPH_BASE + 0x1C00)
#define TIM14_BASE                           (APB1PERIPH_BASE + 0x2000)
#define RTC_BASE                             (APB1PERIPH_BASE + 0x2800)
#define WWDG_BASE                            (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE                            (APB1PERIPH_BASE + 0x3000)
#define SPI2_BASE                            (APB1PERIPH_BASE + 0x3800)
#define SPI3_BASE                            (APB1PERIPH_BASE + 0x3C00)
#define USART2_BASE                          (APB1PERIPH_BASE + 0x4400)
#define USART3_BASE                          (APB1PERIPH_BASE + 0x4800)
#define UART4_BASE                           (APB1PERIPH_BASE + 0x4C00)
#define UART5_BASE                           (APB1PERIPH_BASE + 0x5000)
#define I2C1_BASE                            (APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE                            (APB1PERIPH_BASE + 0x5800)
#define CAN1_BASE                            (APB1PERIPH_BASE + 0x6400)
#define CAN2_BASE                            (APB1PERIPH_BASE + 0x6800)
#define BKP_BASE                             (APB1PERIPH_BASE + 0x6C00)
#define PWR_BASE                             (APB1PERIPH_BASE + 0x7000)
#define DAC_BASE                             (APB1PERIPH_BASE + 0x7400)
#define CEC_BASE                             (APB1PERIPH_BASE + 0x7800)

#define AFIO_BASE                            (APB2PERIPH_BASE + 0x0000)
#define EXTI_BASE                            (APB2PERIPH_BASE + 0x0400)

#define GPIOA_BASE                           (APB2PERIPH_BASE + 0x0800)
#define GPIOB_BASE                           (APB2PERIPH_BASE + 0x0C00)
#define GPIOC_BASE                           (APB2PERIPH_BASE + 0x1000)
#define GPIOD_BASE                           (APB2PERIPH_BASE + 0x1400)
#define GPIOE_BASE                           (APB2PERIPH_BASE + 0x1800)
#define GPIOF_BASE                           (APB2PERIPH_BASE + 0x1C00)
#define GPIOG_BASE                           (APB2PERIPH_BASE + 0x2000)

#define ADC1_BASE                            (APB2PERIPH_BASE + 0x2400)
#define ADC2_BASE                            (APB2PERIPH_BASE + 0x2800)
#define TIM1_BASE                            (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE                            (APB2PERIPH_BASE + 0x3000)
#define TIM8_BASE                            (APB2PERIPH_BASE + 0x3400)
#define USART1_BASE                          (APB2PERIPH_BASE + 0x3800)
#define ADC3_BASE                            (APB2PERIPH_BASE + 0x3C00)
#define TIM15_BASE                           (APB2PERIPH_BASE + 0x4000)
#define TIM16_BASE                           (APB2PERIPH_BASE + 0x4400)
#define TIM17_BASE                           (APB2PERIPH_BASE + 0x4800)
#define TIM9_BASE                            (APB2PERIPH_BASE + 0x4C00)
#define TIM10_BASE                           (APB2PERIPH_BASE + 0x5000)
#define TIM11_BASE                           (APB2PERIPH_BASE + 0x5400)

#define SDIO_BASE                            (ARM_PERIPH_BASE + 0x18000)

#define DMA1_BASE                            (AHBPERIPH_BASE + 0x0000)
#define DMA1_Channel1_BASE                   (AHBPERIPH_BASE + 0x0008)
#define DMA1_Channel2_BASE                   (AHBPERIPH_BASE + 0x001C)
#define DMA1_Channel3_BASE                   (AHBPERIPH_BASE + 0x0030)
#define DMA1_Channel4_BASE                   (AHBPERIPH_BASE + 0x0044)
#define DMA1_Channel5_BASE                   (AHBPERIPH_BASE + 0x0058)
#define DMA1_Channel6_BASE                   (AHBPERIPH_BASE + 0x006C)
#define DMA1_Channel7_BASE                   (AHBPERIPH_BASE + 0x0080)
#define DMA2_BASE                            (AHBPERIPH_BASE + 0x0400)
#define DMA2_Channel1_BASE                   (AHBPERIPH_BASE + 0x0408)
#define DMA2_Channel2_BASE                   (AHBPERIPH_BASE + 0x041C)
#define DMA2_Channel3_BASE                   (AHBPERIPH_BASE + 0x0430)
#define DMA2_Channel4_BASE                   (AHBPERIPH_BASE + 0x0444)
#define DMA2_Channel5_BASE                   (AHBPERIPH_BASE + 0x0458)
#define RCC_BASE                             (AHBPERIPH_BASE + 0x1000)
#define CRC_BASE                             (AHBPERIPH_BASE + 0x3000)

#define FLASH_R_BASE                         (AHBPERIPH_BASE + 0x2000)  /*!< Flash registers base address */
#define OB_BASE                              ((arm_reg_t)0x1FFFF800)    /*!< Flash Option Bytes base address */

#define ETH_BASE                             (AHBPERIPH_BASE + 0x8000)
#define ETH_MAC_BASE                         (ETH_BASE)
#define ETH_MMC_BASE                         (ETH_BASE + 0x0100)
#define ETH_PTP_BASE                         (ETH_BASE + 0x0700)
#define ETH_DMA_BASE                         (ETH_BASE + 0x1000)

#define FSMC_Bank1_R_BASE                    (FSMC_R_BASE + 0x0000)     /*!< FSMC Bank1 registers base address */
#define FSMC_Bank1E_R_BASE                   (FSMC_R_BASE + 0x0104)     /*!< FSMC Bank1E registers base address */
#define FSMC_Bank2_R_BASE                    (FSMC_R_BASE + 0x0060)     /*!< FSMC Bank2 registers base address */
#define FSMC_Bank3_R_BASE                    (FSMC_R_BASE + 0x0080)     /*!< FSMC Bank3 registers base address */
#define FSMC_Bank4_R_BASE                    (FSMC_R_BASE + 0x00A0)     /*!< FSMC Bank4 registers base address */

#define DBGMCU_BASE                          ((arm_reg_t)0xE0042000)    /*!< Debug MCU registers base address */

#define TIM2                ((TIM_t *) TIM2_BASE)
#define TIM3                ((TIM_t *) TIM3_BASE)
#define TIM4                ((TIM_t *) TIM4_BASE)
#define TIM5                ((TIM_t *) TIM5_BASE)
#define TIM6                ((TIM_t *) TIM6_BASE)
#define TIM7                ((TIM_t *) TIM7_BASE)
#define TIM12               ((TIM_t *) TIM12_BASE)
#define TIM13               ((TIM_t *) TIM13_BASE)
#define TIM14               ((TIM_t *) TIM14_BASE)
#define RTC                 ((RTC_t *) RTC_BASE)
#define WWDG                ((WWDG_t *) WWDG_BASE)
#define IWDG                ((IWDG_t *) IWDG_BASE)
#define SPI2                ((SPI_t *) SPI2_BASE)
#define SPI3                ((SPI_t *) SPI3_BASE)
#define USART2              ((USART_t *) USART2_BASE)
#define USART3              ((USART_t *) USART3_BASE)
#define UART4               ((USART_t *) UART4_BASE)
#define UART5               ((USART_t *) UART5_BASE)
#define I2C1                ((I2C_t *) I2C1_BASE)
#define I2C2                ((I2C_t *) I2C2_BASE)
#define CAN1                ((CAN_t *) CAN1_BASE)
#define CAN2                ((CAN_t *) CAN2_BASE)
#define BKP                 ((BKP_t *) BKP_BASE)
#define PWR                 ((PWR_t *) PWR_BASE)
#define DAC                 ((DAC_t *) DAC_BASE)
#define CEC                 ((CEC_t *) CEC_BASE)
#define AFIO                ((AFIO_t *) AFIO_BASE)
#define EXTI                ((EXTI_t *) EXTI_BASE)
#define GPIOA               ((GPIO_t *) GPIOA_BASE)
#define GPIOB               ((GPIO_t *) GPIOB_BASE)
#define GPIOC               ((GPIO_t *) GPIOC_BASE)
#define GPIOD               ((GPIO_t *) GPIOD_BASE)
#define GPIOE               ((GPIO_t *) GPIOE_BASE)
#define GPIOF               ((GPIO_t *) GPIOF_BASE)
#define GPIOG               ((GPIO_t *) GPIOG_BASE)
#define ADC1                ((ADC_t *) ADC1_BASE)
#define ADC2                ((ADC_t *) ADC2_BASE)
#define TIM1                ((TIM_t *) TIM1_BASE)
#define SPI1                ((SPI_t *) SPI1_BASE)
#define TIM8                ((TIM_t *) TIM8_BASE)
#define USART1              ((USART_t *) USART1_BASE)
#define ADC3                ((ADC_t *) ADC3_BASE)
#define TIM15               ((TIM_t *) TIM15_BASE)
#define TIM16               ((TIM_t *) TIM16_BASE)
#define TIM17               ((TIM_t *) TIM17_BASE)
#define TIM9                ((TIM_t *) TIM9_BASE)
#define TIM10               ((TIM_t *) TIM10_BASE)
#define TIM11               ((TIM_t *) TIM11_BASE)
#define SDIO                ((SDIO_t *) SDIO_BASE)
#define DMA1                ((DMA_t *) DMA1_BASE)
#define DMA2                ((DMA_t *) DMA2_BASE)
#define DMA1_Channel1       ((DMA_STREAM_t *) DMA1_Channel1_BASE)
#define DMA1_Channel2       ((DMA_STREAM_t *) DMA1_Channel2_BASE)
#define DMA1_Channel3       ((DMA_STREAM_t *) DMA1_Channel3_BASE)
#define DMA1_Channel4       ((DMA_STREAM_t *) DMA1_Channel4_BASE)
#define DMA1_Channel5       ((DMA_STREAM_t *) DMA1_Channel5_BASE)
#define DMA1_Channel6       ((DMA_STREAM_t *) DMA1_Channel6_BASE)
#define DMA1_Channel7       ((DMA_STREAM_t *) DMA1_Channel7_BASE)
#define DMA2_Channel1       ((DMA_STREAM_t *) DMA2_Channel1_BASE)
#define DMA2_Channel2       ((DMA_STREAM_t *) DMA2_Channel2_BASE)
#define DMA2_Channel3       ((DMA_STREAM_t *) DMA2_Channel3_BASE)
#define DMA2_Channel4       ((DMA_STREAM_t *) DMA2_Channel4_BASE)
#define DMA2_Channel5       ((DMA_STREAM_t *) DMA2_Channel5_BASE)
#define RCC                 ((RCC_t *) RCC_BASE)
#define CRC                 ((CRC_t *) CRC_BASE)
#define FLASH               ((FLASH_t *) FLASH_R_BASE)
#define OB                  ((OB_t *) OB_BASE)
#define ETH                 ((ETH_t *) ETH_BASE)
#define FSMC_Bank1          ((FSMC_Bank1_t *) FSMC_Bank1_R_BASE)
#define FSMC_Bank1E         ((FSMC_Bank1E_t *) FSMC_Bank1E_R_BASE)
#define FSMC_Bank2          ((FSMC_Bank2_t *) FSMC_Bank2_R_BASE)
#define FSMC_Bank3          ((FSMC_Bank3_t *) FSMC_Bank3_R_BASE)
#define FSMC_Bank4          ((FSMC_Bank4_t *) FSMC_Bank4_R_BASE)
#define DBGMCU              ((DBGMCU_t *) DBGMCU_BASE)

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                          CRC calculation unit                              */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for CRC_DR register  *********************/
#define  CRC_DR_DR                           ((arm_reg_t)0xFFFFFFFF) /*!< Data register bits */


/*******************  Bit definition for CRC_IDR register  ********************/
#define  CRC_IDR_IDR                         ((uint8_t)0xFF)        /*!< General-purpose 8-bit data register bits */


/********************  Bit definition for CRC_CR register  ********************/
#define  CRC_CR_RESET                        ((uint8_t)0x01)        /*!< RESET bit */

/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for PWR_CR register  ********************/
#define  PWR_CR_LPDS                         ((uint16_t)0x0001)     /*!< Low-Power Deepsleep */
#define  PWR_CR_PDDS                         ((uint16_t)0x0002)     /*!< Power Down Deepsleep */
#define  PWR_CR_CWUF                         ((uint16_t)0x0004)     /*!< Clear Wakeup Flag */
#define  PWR_CR_CSBF                         ((uint16_t)0x0008)     /*!< Clear Standby Flag */
#define  PWR_CR_PVDE                         ((uint16_t)0x0010)     /*!< Power Voltage Detector Enable */

#define  PWR_CR_PLS                          ((uint16_t)0x00E0)     /*!< PLS[2:0] bits (PVD Level Selection) */
#define  PWR_CR_PLS_0                        ((uint16_t)0x0020)     /*!< Bit 0 */
#define  PWR_CR_PLS_1                        ((uint16_t)0x0040)     /*!< Bit 1 */
#define  PWR_CR_PLS_2                        ((uint16_t)0x0080)     /*!< Bit 2 */

/*!< PVD level configuration */
#define  PWR_CR_PLS_2V2                      ((uint16_t)0x0000)     /*!< PVD level 2.2V */
#define  PWR_CR_PLS_2V3                      ((uint16_t)0x0020)     /*!< PVD level 2.3V */
#define  PWR_CR_PLS_2V4                      ((uint16_t)0x0040)     /*!< PVD level 2.4V */
#define  PWR_CR_PLS_2V5                      ((uint16_t)0x0060)     /*!< PVD level 2.5V */
#define  PWR_CR_PLS_2V6                      ((uint16_t)0x0080)     /*!< PVD level 2.6V */
#define  PWR_CR_PLS_2V7                      ((uint16_t)0x00A0)     /*!< PVD level 2.7V */
#define  PWR_CR_PLS_2V8                      ((uint16_t)0x00C0)     /*!< PVD level 2.8V */
#define  PWR_CR_PLS_2V9                      ((uint16_t)0x00E0)     /*!< PVD level 2.9V */

#define  PWR_CR_DBP                          ((uint16_t)0x0100)     /*!< Disable Backup Domain write protection */


/*******************  Bit definition for PWR_CSR register  ********************/
#define  PWR_CSR_WUF                         ((uint16_t)0x0001)     /*!< Wakeup Flag */
#define  PWR_CSR_SBF                         ((uint16_t)0x0002)     /*!< Standby Flag */
#define  PWR_CSR_PVDO                        ((uint16_t)0x0004)     /*!< PVD Output */
#define  PWR_CSR_EWUP                        ((uint16_t)0x0100)     /*!< Enable WKUP pin */

/******************************************************************************/
/*                            Backup registers                                */
/******************************************************************************/

/*******************  Bit definition for BKP_DR1 register  ********************/
#define  BKP_DR1_D                           ((uint16_t)0xFFFF)     /*!< Backup data */

