ZhVladimir89/uos-embedded/sources/runtime/cortex-m/io-stm32f1.h
#if defined (STM32F10X_LD_VL) || defined  (STM32F10X_MD_VL) || defined  (STM32F10X_HD_VL)
#define  RCC_APB1ENR_TIM6EN                  ((arm_reg_t)0x00000010)        /*!< Timer 6 clock enable */
#define  RCC_APB1ENR_TIM7EN                  ((arm_reg_t)0x00000020)        /*!< Timer 7 clock enable */
#define  RCC_APB1ENR_DACEN                   ((arm_reg_t)0x20000000)        /*!< DAC interface clock enable */
#define  RCC_APB1ENR_CECEN                   ((arm_reg_t)0x40000000)        /*!< CEC interface clock enable */
#endif

#ifdef STM32F10X_HD_VL
#define  RCC_APB1ENR_TIM5EN                  ((arm_reg_t)0x00000008)        /*!< Timer 5 clock enable */
#define  RCC_APB1ENR_TIM12EN                 ((arm_reg_t)0x00000040)        /*!< TIM12 Timer clock enable */
#define  RCC_APB1ENR_TIM13EN                 ((arm_reg_t)0x00000080)        /*!< TIM13 Timer clock enable */
#define  RCC_APB1ENR_TIM14EN                 ((arm_reg_t)0x00000100)        /*!< TIM14 Timer clock enable */
#define  RCC_APB1ENR_SPI3EN                  ((arm_reg_t)0x00008000)        /*!< SPI 3 clock enable */
#define  RCC_APB1ENR_UART4EN                 ((arm_reg_t)0x00080000)        /*!< UART 4 clock enable */
#define  RCC_APB1ENR_UART5EN                 ((arm_reg_t)0x00100000)        /*!< UART 5 clock enable */
#endif /* STM32F10X_HD_VL */

#ifdef STM32F10X_CL
#define  RCC_APB1ENR_CAN2EN                  ((arm_reg_t)0x04000000)        /*!< CAN2 clock enable */
#endif /* STM32F10X_CL */

#ifdef STM32F10X_XL
#define  RCC_APB1ENR_TIM12EN                 ((arm_reg_t)0x00000040)        /*!< TIM12 Timer clock enable  */
#define  RCC_APB1ENR_TIM13EN                 ((arm_reg_t)0x00000080)        /*!< TIM13 Timer clock enable  */
#define  RCC_APB1ENR_TIM14EN                 ((arm_reg_t)0x00000100)        /*!< TIM14 Timer clock enable */
#endif /* STM32F10X_XL */

/*******************  Bit definition for RCC_BDCR register  *******************/
#define  RCC_BDCR_LSEON                      ((arm_reg_t)0x00000001)        /*!< External Low Speed oscillator enable */
#define  RCC_BDCR_LSERDY                     ((arm_reg_t)0x00000002)        /*!< External Low Speed oscillator Ready */
#define  RCC_BDCR_LSEBYP                     ((arm_reg_t)0x00000004)        /*!< External Low Speed oscillator Bypass */

#define  RCC_BDCR_RTCSEL                     ((arm_reg_t)0x00000300)        /*!< RTCSEL[1:0] bits (RTC clock source selection) */
#define  RCC_BDCR_RTCSEL_0                   ((arm_reg_t)0x00000100)        /*!< Bit 0 */
#define  RCC_BDCR_RTCSEL_1                   ((arm_reg_t)0x00000200)        /*!< Bit 1 */

/*!< RTC congiguration */
#define  RCC_BDCR_RTCSEL_NOCLOCK             ((arm_reg_t)0x00000000)        /*!< No clock */
#define  RCC_BDCR_RTCSEL_LSE                 ((arm_reg_t)0x00000100)        /*!< LSE oscillator clock used as RTC clock */
#define  RCC_BDCR_RTCSEL_LSI                 ((arm_reg_t)0x00000200)        /*!< LSI oscillator clock used as RTC clock */
#define  RCC_BDCR_RTCSEL_HSE                 ((arm_reg_t)0x00000300)        /*!< HSE oscillator clock divided by 128 used as RTC clock */

#define  RCC_BDCR_RTCEN                      ((arm_reg_t)0x00008000)        /*!< RTC clock enable */
#define  RCC_BDCR_BDRST                      ((arm_reg_t)0x00010000)        /*!< Backup domain software reset  */

/*******************  Bit definition for RCC_CSR register  ********************/
#define  RCC_CSR_LSION                       ((arm_reg_t)0x00000001)        /*!< Internal Low Speed oscillator enable */
#define  RCC_CSR_LSIRDY                      ((arm_reg_t)0x00000002)        /*!< Internal Low Speed oscillator Ready */
#define  RCC_CSR_RMVF                        ((arm_reg_t)0x01000000)        /*!< Remove reset flag */
#define  RCC_CSR_PINRSTF                     ((arm_reg_t)0x04000000)        /*!< PIN reset flag */
#define  RCC_CSR_PORRSTF                     ((arm_reg_t)0x08000000)        /*!< POR/PDR reset flag */
#define  RCC_CSR_SFTRSTF                     ((arm_reg_t)0x10000000)        /*!< Software Reset flag */
#define  RCC_CSR_IWDGRSTF                    ((arm_reg_t)0x20000000)        /*!< Independent Watchdog reset flag */
#define  RCC_CSR_WWDGRSTF                    ((arm_reg_t)0x40000000)        /*!< Window watchdog reset flag */
#define  RCC_CSR_LPWRRSTF                    ((arm_reg_t)0x80000000)        /*!< Low-Power reset flag */

#ifdef STM32F10X_CL
/*******************  Bit definition for RCC_AHBRSTR register  ****************/
#define  RCC_AHBRSTR_OTGFSRST                ((arm_reg_t)0x00001000)         /*!< USB OTG FS reset */
#define  RCC_AHBRSTR_ETHMACRST               ((arm_reg_t)0x00004000)         /*!< ETHERNET MAC reset */

/*******************  Bit definition for RCC_CFGR2 register  ******************/
/*!< PREDIV1 configuration */
#define  RCC_CFGR2_PREDIV1                   ((arm_reg_t)0x0000000F)        /*!< PREDIV1[3:0] bits */
#define  RCC_CFGR2_PREDIV1_0                 ((arm_reg_t)0x00000001)        /*!< Bit 0 */
#define  RCC_CFGR2_PREDIV1_1                 ((arm_reg_t)0x00000002)        /*!< Bit 1 */
#define  RCC_CFGR2_PREDIV1_2                 ((arm_reg_t)0x00000004)        /*!< Bit 2 */
#define  RCC_CFGR2_PREDIV1_3                 ((arm_reg_t)0x00000008)        /*!< Bit 3 */

#define  RCC_CFGR2_PREDIV1_DIV1              ((arm_reg_t)0x00000000)        /*!< PREDIV1 input clock not divided */
#define  RCC_CFGR2_PREDIV1_DIV2              ((arm_reg_t)0x00000001)        /*!< PREDIV1 input clock divided by 2 */
#define  RCC_CFGR2_PREDIV1_DIV3              ((arm_reg_t)0x00000002)        /*!< PREDIV1 input clock divided by 3 */
#define  RCC_CFGR2_PREDIV1_DIV4              ((arm_reg_t)0x00000003)        /*!< PREDIV1 input clock divided by 4 */
#define  RCC_CFGR2_PREDIV1_DIV5              ((arm_reg_t)0x00000004)        /*!< PREDIV1 input clock divided by 5 */
#define  RCC_CFGR2_PREDIV1_DIV6              ((arm_reg_t)0x00000005)        /*!< PREDIV1 input clock divided by 6 */
#define  RCC_CFGR2_PREDIV1_DIV7              ((arm_reg_t)0x00000006)        /*!< PREDIV1 input clock divided by 7 */
#define  RCC_CFGR2_PREDIV1_DIV8              ((arm_reg_t)0x00000007)        /*!< PREDIV1 input clock divided by 8 */
#define  RCC_CFGR2_PREDIV1_DIV9              ((arm_reg_t)0x00000008)        /*!< PREDIV1 input clock divided by 9 */
#define  RCC_CFGR2_PREDIV1_DIV10             ((arm_reg_t)0x00000009)        /*!< PREDIV1 input clock divided by 10 */
#define  RCC_CFGR2_PREDIV1_DIV11             ((arm_reg_t)0x0000000A)        /*!< PREDIV1 input clock divided by 11 */
#define  RCC_CFGR2_PREDIV1_DIV12             ((arm_reg_t)0x0000000B)        /*!< PREDIV1 input clock divided by 12 */
#define  RCC_CFGR2_PREDIV1_DIV13             ((arm_reg_t)0x0000000C)        /*!< PREDIV1 input clock divided by 13 */
#define  RCC_CFGR2_PREDIV1_DIV14             ((arm_reg_t)0x0000000D)        /*!< PREDIV1 input clock divided by 14 */
#define  RCC_CFGR2_PREDIV1_DIV15             ((arm_reg_t)0x0000000E)        /*!< PREDIV1 input clock divided by 15 */
#define  RCC_CFGR2_PREDIV1_DIV16             ((arm_reg_t)0x0000000F)        /*!< PREDIV1 input clock divided by 16 */

