ZhVladimir89/uos-embedded/sources/runtime/cortex-m/io-stm32f1.h
#define  FLASH_OBR_USER                      ((uint16_t)0x03FC)            /*!< User Option Bytes */
#define  FLASH_OBR_WDG_SW                    ((uint16_t)0x0004)            /*!< WDG_SW */
#define  FLASH_OBR_nRST_STOP                 ((uint16_t)0x0008)            /*!< nRST_STOP */
#define  FLASH_OBR_nRST_STDBY                ((uint16_t)0x0010)            /*!< nRST_STDBY */
#define  FLASH_OBR_BFB2                      ((uint16_t)0x0020)            /*!< BFB2 */

/******************  Bit definition for FLASH_WRPR register  ******************/
#define  FLASH_WRPR_WRP                      ((arm_reg_t)0xFFFFFFFF)        /*!< Write Protect */

/*----------------------------------------------------------------------------*/

/******************  Bit definition for FLASH_RDP register  *******************/
#define  FLASH_RDP_RDP                       ((arm_reg_t)0x000000FF)        /*!< Read protection option byte */
#define  FLASH_RDP_nRDP                      ((arm_reg_t)0x0000FF00)        /*!< Read protection complemented option byte */

/******************  Bit definition for FLASH_USER register  ******************/
#define  FLASH_USER_USER                     ((arm_reg_t)0x00FF0000)        /*!< User option byte */
#define  FLASH_USER_nUSER                    ((arm_reg_t)0xFF000000)        /*!< User complemented option byte */

/******************  Bit definition for FLASH_Data0 register  *****************/
#define  FLASH_Data0_Data0                   ((arm_reg_t)0x000000FF)        /*!< User data storage option byte */
#define  FLASH_Data0_nData0                  ((arm_reg_t)0x0000FF00)        /*!< User data storage complemented option byte */

/******************  Bit definition for FLASH_Data1 register  *****************/
#define  FLASH_Data1_Data1                   ((arm_reg_t)0x00FF0000)        /*!< User data storage option byte */
#define  FLASH_Data1_nData1                  ((arm_reg_t)0xFF000000)        /*!< User data storage complemented option byte */

/******************  Bit definition for FLASH_WRP0 register  ******************/
#define  FLASH_WRP0_WRP0                     ((arm_reg_t)0x000000FF)        /*!< Flash memory write protection option bytes */
#define  FLASH_WRP0_nWRP0                    ((arm_reg_t)0x0000FF00)        /*!< Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRP1 register  ******************/
#define  FLASH_WRP1_WRP1                     ((arm_reg_t)0x00FF0000)        /*!< Flash memory write protection option bytes */
#define  FLASH_WRP1_nWRP1                    ((arm_reg_t)0xFF000000)        /*!< Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRP2 register  ******************/
#define  FLASH_WRP2_WRP2                     ((arm_reg_t)0x000000FF)        /*!< Flash memory write protection option bytes */
#define  FLASH_WRP2_nWRP2                    ((arm_reg_t)0x0000FF00)        /*!< Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRP3 register  ******************/
#define  FLASH_WRP3_WRP3                     ((arm_reg_t)0x00FF0000)        /*!< Flash memory write protection option bytes */
#define  FLASH_WRP3_nWRP3                    ((arm_reg_t)0xFF000000)        /*!< Flash memory write protection complemented option bytes */

#ifdef STM32F10X_CL
/******************************************************************************/
/*                Ethernet MAC Registers bits definitions                     */
/******************************************************************************/
/* Bit definition for Ethernet MAC Control Register register */
#define ETH_MACCR_WD                 ((arm_reg_t)0x00800000)  /* Watchdog disable */
#define ETH_MACCR_JD                 ((arm_reg_t)0x00400000)  /* Jabber disable */
#define ETH_MACCR_IFG                ((arm_reg_t)0x000E0000)  /* Inter-frame gap */
#define ETH_MACCR_IFG_96Bit          ((arm_reg_t)0x00000000)  /* Minimum IFG between frames during transmission is 96Bit */
#define ETH_MACCR_IFG_88Bit          ((arm_reg_t)0x00020000)  /* Minimum IFG between frames during transmission is 88Bit */
#define ETH_MACCR_IFG_80Bit          ((arm_reg_t)0x00040000)  /* Minimum IFG between frames during transmission is 80Bit */
#define ETH_MACCR_IFG_72Bit          ((arm_reg_t)0x00060000)  /* Minimum IFG between frames during transmission is 72Bit */
#define ETH_MACCR_IFG_64Bit          ((arm_reg_t)0x00080000)  /* Minimum IFG between frames during transmission is 64Bit */
#define ETH_MACCR_IFG_56Bit          ((arm_reg_t)0x000A0000)  /* Minimum IFG between frames during transmission is 56Bit */
#define ETH_MACCR_IFG_48Bit          ((arm_reg_t)0x000C0000)  /* Minimum IFG between frames during transmission is 48Bit */
#define ETH_MACCR_IFG_40Bit          ((arm_reg_t)0x000E0000)  /* Minimum IFG between frames during transmission is 40Bit */
#define ETH_MACCR_CSD                ((arm_reg_t)0x00010000)  /* Carrier sense disable (during transmission) */
#define ETH_MACCR_FES                ((arm_reg_t)0x00004000)  /* Fast ethernet speed */
#define ETH_MACCR_ROD                ((arm_reg_t)0x00002000)  /* Receive own disable */
#define ETH_MACCR_LM                 ((arm_reg_t)0x00001000)  /* loopback mode */
#define ETH_MACCR_DM                 ((arm_reg_t)0x00000800)  /* Duplex mode */
#define ETH_MACCR_IPCO               ((arm_reg_t)0x00000400)  /* IP Checksum offload */
#define ETH_MACCR_RD                 ((arm_reg_t)0x00000200)  /* Retry disable */
#define ETH_MACCR_APCS               ((arm_reg_t)0x00000080)  /* Automatic Pad/CRC stripping */
#define ETH_MACCR_BL                 ((arm_reg_t)0x00000060)  /* Back-off limit: random integer number (r) of slot time delays before rescheduling
    a transmission attempt during retries after a collision: 0 =< r <2^k */
#define ETH_MACCR_BL_10              ((arm_reg_t)0x00000000)  /* k = min (n, 10) */
#define ETH_MACCR_BL_8               ((arm_reg_t)0x00000020)  /* k = min (n, 8) */
#define ETH_MACCR_BL_4               ((arm_reg_t)0x00000040)  /* k = min (n, 4) */
#define ETH_MACCR_BL_1               ((arm_reg_t)0x00000060)  /* k = min (n, 1) */
#define ETH_MACCR_DC                 ((arm_reg_t)0x00000010)  /* Defferal check */
#define ETH_MACCR_TE                 ((arm_reg_t)0x00000008)  /* Transmitter enable */
#define ETH_MACCR_RE                 ((arm_reg_t)0x00000004)  /* Receiver enable */

