ZhVladimir89/uos-embedded/sources/runtime/cortex-m/io-stm32f1.h
/* Bit definition for Ethernet MMC Received Frames with CRC Error Counter Register */
#define ETH_MMCRFCECR_RFCEC          ((arm_reg_t)0xFFFFFFFF)  /* Number of frames received with CRC error. */

/* Bit definition for Ethernet MMC Received Frames with Alignement Error Counter Register */
#define ETH_MMCRFAECR_RFAEC          ((arm_reg_t)0xFFFFFFFF)  /* Number of frames received with alignment (dribble) error */

/* Bit definition for Ethernet MMC Received Good Unicast Frames Counter Register */
#define ETH_MMCRGUFCR_RGUFC          ((arm_reg_t)0xFFFFFFFF)  /* Number of good unicast frames received. */

/******************************************************************************/
/*               Ethernet PTP Registers bits definition                       */
/******************************************************************************/

/* Bit definition for Ethernet PTP Time Stamp Contol Register */
#define ETH_PTPTSCR_TSARU            ((arm_reg_t)0x00000020)  /* Addend register update */
#define ETH_PTPTSCR_TSITE            ((arm_reg_t)0x00000010)  /* Time stamp interrupt trigger enable */
#define ETH_PTPTSCR_TSSTU            ((arm_reg_t)0x00000008)  /* Time stamp update */
#define ETH_PTPTSCR_TSSTI            ((arm_reg_t)0x00000004)  /* Time stamp initialize */
#define ETH_PTPTSCR_TSFCU            ((arm_reg_t)0x00000002)  /* Time stamp fine or coarse update */
#define ETH_PTPTSCR_TSE              ((arm_reg_t)0x00000001)  /* Time stamp enable */

/* Bit definition for Ethernet PTP Sub-Second Increment Register */
#define ETH_PTPSSIR_STSSI            ((arm_reg_t)0x000000FF)  /* System time Sub-second increment value */

/* Bit definition for Ethernet PTP Time Stamp High Register */
#define ETH_PTPTSHR_STS              ((arm_reg_t)0xFFFFFFFF)  /* System Time second */

/* Bit definition for Ethernet PTP Time Stamp Low Register */
#define ETH_PTPTSLR_STPNS            ((arm_reg_t)0x80000000)  /* System Time Positive or negative time */
#define ETH_PTPTSLR_STSS             ((arm_reg_t)0x7FFFFFFF)  /* System Time sub-seconds */

/* Bit definition for Ethernet PTP Time Stamp High Update Register */
#define ETH_PTPTSHUR_TSUS            ((arm_reg_t)0xFFFFFFFF)  /* Time stamp update seconds */

/* Bit definition for Ethernet PTP Time Stamp Low Update Register */
#define ETH_PTPTSLUR_TSUPNS          ((arm_reg_t)0x80000000)  /* Time stamp update Positive or negative time */
#define ETH_PTPTSLUR_TSUSS           ((arm_reg_t)0x7FFFFFFF)  /* Time stamp update sub-seconds */

/* Bit definition for Ethernet PTP Time Stamp Addend Register */
#define ETH_PTPTSAR_TSA              ((arm_reg_t)0xFFFFFFFF)  /* Time stamp addend */

/* Bit definition for Ethernet PTP Target Time High Register */
#define ETH_PTPTTHR_TTSH             ((arm_reg_t)0xFFFFFFFF)  /* Target time stamp high */

/* Bit definition for Ethernet PTP Target Time Low Register */
#define ETH_PTPTTLR_TTSL             ((arm_reg_t)0xFFFFFFFF)  /* Target time stamp low */

/******************************************************************************/
/*                 Ethernet DMA Registers bits definition                     */
/******************************************************************************/

/* Bit definition for Ethernet DMA Bus Mode Register */
#define ETH_DMABMR_AAB               ((arm_reg_t)0x02000000)  /* Address-Aligned beats */
#define ETH_DMABMR_FPM               ((arm_reg_t)0x01000000)  /* 4xPBL mode */
#define ETH_DMABMR_USP               ((arm_reg_t)0x00800000)  /* Use separate PBL */
#define ETH_DMABMR_RDP               ((arm_reg_t)0x007E0000)  /* RxDMA PBL */
#define ETH_DMABMR_RDP_1Beat         ((arm_reg_t)0x00020000)  /* maximum number of beats to be transferred in one RxDMA transaction is 1 */
#define ETH_DMABMR_RDP_2Beat         ((arm_reg_t)0x00040000)  /* maximum number of beats to be transferred in one RxDMA transaction is 2 */
#define ETH_DMABMR_RDP_4Beat         ((arm_reg_t)0x00080000)  /* maximum number of beats to be transferred in one RxDMA transaction is 4 */
#define ETH_DMABMR_RDP_8Beat         ((arm_reg_t)0x00100000)  /* maximum number of beats to be transferred in one RxDMA transaction is 8 */
#define ETH_DMABMR_RDP_16Beat        ((arm_reg_t)0x00200000)  /* maximum number of beats to be transferred in one RxDMA transaction is 16 */
#define ETH_DMABMR_RDP_32Beat        ((arm_reg_t)0x00400000)  /* maximum number of beats to be transferred in one RxDMA transaction is 32 */
#define ETH_DMABMR_RDP_4xPBL_4Beat   ((arm_reg_t)0x01020000)  /* maximum number of beats to be transferred in one RxDMA transaction is 4 */
#define ETH_DMABMR_RDP_4xPBL_8Beat   ((arm_reg_t)0x01040000)  /* maximum number of beats to be transferred in one RxDMA transaction is 8 */
#define ETH_DMABMR_RDP_4xPBL_16Beat  ((arm_reg_t)0x01080000)  /* maximum number of beats to be transferred in one RxDMA transaction is 16 */
#define ETH_DMABMR_RDP_4xPBL_32Beat  ((arm_reg_t)0x01100000)  /* maximum number of beats to be transferred in one RxDMA transaction is 32 */
#define ETH_DMABMR_RDP_4xPBL_64Beat  ((arm_reg_t)0x01200000)  /* maximum number of beats to be transferred in one RxDMA transaction is 64 */
#define ETH_DMABMR_RDP_4xPBL_128Beat ((arm_reg_t)0x01400000)  /* maximum number of beats to be transferred in one RxDMA transaction is 128 */
#define ETH_DMABMR_FB                ((arm_reg_t)0x00010000)  /* Fixed Burst */
#define ETH_DMABMR_RTPR              ((arm_reg_t)0x0000C000)  /* Rx Tx priority ratio */
#define ETH_DMABMR_RTPR_1_1          ((arm_reg_t)0x00000000)  /* Rx Tx priority ratio */
#define ETH_DMABMR_RTPR_2_1          ((arm_reg_t)0x00004000)  /* Rx Tx priority ratio */
#define ETH_DMABMR_RTPR_3_1          ((arm_reg_t)0x00008000)  /* Rx Tx priority ratio */
#define ETH_DMABMR_RTPR_4_1          ((arm_reg_t)0x0000C000)  /* Rx Tx priority ratio */
#define ETH_DMABMR_PBL               ((arm_reg_t)0x00003F00)  /* Programmable burst length */
#define ETH_DMABMR_PBL_1Beat         ((arm_reg_t)0x00000100)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 1 */
#define ETH_DMABMR_PBL_2Beat         ((arm_reg_t)0x00000200)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 2 */
#define ETH_DMABMR_PBL_4Beat         ((arm_reg_t)0x00000400)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
#define ETH_DMABMR_PBL_8Beat         ((arm_reg_t)0x00000800)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_DMABMR_PBL_16Beat        ((arm_reg_t)0x00001000)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_DMABMR_PBL_32Beat        ((arm_reg_t)0x00002000)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_DMABMR_PBL_4xPBL_4Beat   ((arm_reg_t)0x01000100)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
#define ETH_DMABMR_PBL_4xPBL_8Beat   ((arm_reg_t)0x01000200)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_DMABMR_PBL_4xPBL_16Beat  ((arm_reg_t)0x01000400)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_DMABMR_PBL_4xPBL_32Beat  ((arm_reg_t)0x01000800)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_DMABMR_PBL_4xPBL_64Beat  ((arm_reg_t)0x01001000)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 64 */
#define ETH_DMABMR_PBL_4xPBL_128Beat ((arm_reg_t)0x01002000)  /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 128 */
#define ETH_DMABMR_DSL               ((arm_reg_t)0x0000007C)  /* Descriptor Skip Length */
#define ETH_DMABMR_DA                ((arm_reg_t)0x00000002)  /* DMA arbitration scheme */
#define ETH_DMABMR_SR                ((arm_reg_t)0x00000001)  /* Software reset */

