ZhVladimir89/uos-embedded/sources/runtime/cortex-m/io-stm32f1.h
/* Bit definition for Ethernet DMA Transmit Poll Demand Register */
#define ETH_DMATPDR_TPD              ((arm_reg_t)0xFFFFFFFF)  /* Transmit poll demand */

/* Bit definition for Ethernet DMA Receive Poll Demand Register */
#define ETH_DMARPDR_RPD              ((arm_reg_t)0xFFFFFFFF)  /* Receive poll demand  */

/* Bit definition for Ethernet DMA Receive Descriptor List Address Register */
#define ETH_DMARDLAR_SRL             ((arm_reg_t)0xFFFFFFFF)  /* Start of receive list */

/* Bit definition for Ethernet DMA Transmit Descriptor List Address Register */
#define ETH_DMATDLAR_STL             ((arm_reg_t)0xFFFFFFFF)  /* Start of transmit list */

/* Bit definition for Ethernet DMA Status Register */
#define ETH_DMASR_TSTS               ((arm_reg_t)0x20000000)  /* Time-stamp trigger status */
#define ETH_DMASR_PMTS               ((arm_reg_t)0x10000000)  /* PMT status */
#define ETH_DMASR_MMCS               ((arm_reg_t)0x08000000)  /* MMC status */
#define ETH_DMASR_EBS                ((arm_reg_t)0x03800000)  /* Error bits status */
/* combination with EBS[2:0] for GetFlagStatus function */
#define ETH_DMASR_EBS_DescAccess     ((arm_reg_t)0x02000000)  /* Error bits 0-data buffer, 1-desc. access */
#define ETH_DMASR_EBS_ReadTransf     ((arm_reg_t)0x01000000)  /* Error bits 0-write trnsf, 1-read transfr */
#define ETH_DMASR_EBS_DataTransfTx   ((arm_reg_t)0x00800000)  /* Error bits 0-Rx DMA, 1-Tx DMA */
#define ETH_DMASR_TPS                ((arm_reg_t)0x00700000)  /* Transmit process state */
#define ETH_DMASR_TPS_Stopped        ((arm_reg_t)0x00000000)  /* Stopped - Reset or Stop Tx Command issued  */
#define ETH_DMASR_TPS_Fetching       ((arm_reg_t)0x00100000)  /* Running - fetching the Tx descriptor */
#define ETH_DMASR_TPS_Waiting        ((arm_reg_t)0x00200000)  /* Running - waiting for status */
#define ETH_DMASR_TPS_Reading        ((arm_reg_t)0x00300000)  /* Running - reading the data from host memory */
#define ETH_DMASR_TPS_Suspended      ((arm_reg_t)0x00600000)  /* Suspended - Tx Descriptor unavailabe */
#define ETH_DMASR_TPS_Closing        ((arm_reg_t)0x00700000)  /* Running - closing Rx descriptor */
#define ETH_DMASR_RPS                ((arm_reg_t)0x000E0000)  /* Receive process state */
#define ETH_DMASR_RPS_Stopped        ((arm_reg_t)0x00000000)  /* Stopped - Reset or Stop Rx Command issued */
#define ETH_DMASR_RPS_Fetching       ((arm_reg_t)0x00020000)  /* Running - fetching the Rx descriptor */
#define ETH_DMASR_RPS_Waiting        ((arm_reg_t)0x00060000)  /* Running - waiting for packet */
#define ETH_DMASR_RPS_Suspended      ((arm_reg_t)0x00080000)  /* Suspended - Rx Descriptor unavailable */
#define ETH_DMASR_RPS_Closing        ((arm_reg_t)0x000A0000)  /* Running - closing descriptor */
#define ETH_DMASR_RPS_Queuing        ((arm_reg_t)0x000E0000)  /* Running - queuing the recieve frame into host memory */
#define ETH_DMASR_NIS                ((arm_reg_t)0x00010000)  /* Normal interrupt summary */
#define ETH_DMASR_AIS                ((arm_reg_t)0x00008000)  /* Abnormal interrupt summary */
#define ETH_DMASR_ERS                ((arm_reg_t)0x00004000)  /* Early receive status */
#define ETH_DMASR_FBES               ((arm_reg_t)0x00002000)  /* Fatal bus error status */
#define ETH_DMASR_ETS                ((arm_reg_t)0x00000400)  /* Early transmit status */
#define ETH_DMASR_RWTS               ((arm_reg_t)0x00000200)  /* Receive watchdog timeout status */
#define ETH_DMASR_RPSS               ((arm_reg_t)0x00000100)  /* Receive process stopped status */
#define ETH_DMASR_RBUS               ((arm_reg_t)0x00000080)  /* Receive buffer unavailable status */
#define ETH_DMASR_RS                 ((arm_reg_t)0x00000040)  /* Receive status */
#define ETH_DMASR_TUS                ((arm_reg_t)0x00000020)  /* Transmit underflow status */
#define ETH_DMASR_ROS                ((arm_reg_t)0x00000010)  /* Receive overflow status */
#define ETH_DMASR_TJTS               ((arm_reg_t)0x00000008)  /* Transmit jabber timeout status */
#define ETH_DMASR_TBUS               ((arm_reg_t)0x00000004)  /* Transmit buffer unavailable status */
#define ETH_DMASR_TPSS               ((arm_reg_t)0x00000002)  /* Transmit process stopped status */
#define ETH_DMASR_TS                 ((arm_reg_t)0x00000001)  /* Transmit status */

/* Bit definition for Ethernet DMA Operation Mode Register */
#define ETH_DMAOMR_DTCEFD            ((arm_reg_t)0x04000000)  /* Disable Dropping of TCP/IP checksum error frames */
#define ETH_DMAOMR_RSF               ((arm_reg_t)0x02000000)  /* Receive store and forward */
#define ETH_DMAOMR_DFRF              ((arm_reg_t)0x01000000)  /* Disable flushing of received frames */
#define ETH_DMAOMR_TSF               ((arm_reg_t)0x00200000)  /* Transmit store and forward */
#define ETH_DMAOMR_FTF               ((arm_reg_t)0x00100000)  /* Flush transmit FIFO */
#define ETH_DMAOMR_TTC               ((arm_reg_t)0x0001C000)  /* Transmit threshold control */
#define ETH_DMAOMR_TTC_64Bytes       ((arm_reg_t)0x00000000)  /* threshold level of the MTL Transmit FIFO is 64 Bytes */
#define ETH_DMAOMR_TTC_128Bytes      ((arm_reg_t)0x00004000)  /* threshold level of the MTL Transmit FIFO is 128 Bytes */
#define ETH_DMAOMR_TTC_192Bytes      ((arm_reg_t)0x00008000)  /* threshold level of the MTL Transmit FIFO is 192 Bytes */
#define ETH_DMAOMR_TTC_256Bytes      ((arm_reg_t)0x0000C000)  /* threshold level of the MTL Transmit FIFO is 256 Bytes */
#define ETH_DMAOMR_TTC_40Bytes       ((arm_reg_t)0x00010000)  /* threshold level of the MTL Transmit FIFO is 40 Bytes */
#define ETH_DMAOMR_TTC_32Bytes       ((arm_reg_t)0x00014000)  /* threshold level of the MTL Transmit FIFO is 32 Bytes */
#define ETH_DMAOMR_TTC_24Bytes       ((arm_reg_t)0x00018000)  /* threshold level of the MTL Transmit FIFO is 24 Bytes */
#define ETH_DMAOMR_TTC_16Bytes       ((arm_reg_t)0x0001C000)  /* threshold level of the MTL Transmit FIFO is 16 Bytes */
#define ETH_DMAOMR_ST                ((arm_reg_t)0x00002000)  /* Start/stop transmission command */
#define ETH_DMAOMR_FEF               ((arm_reg_t)0x00000080)  /* Forward error frames */
#define ETH_DMAOMR_FUGF              ((arm_reg_t)0x00000040)  /* Forward undersized good frames */
#define ETH_DMAOMR_RTC               ((arm_reg_t)0x00000018)  /* receive threshold control */
#define ETH_DMAOMR_RTC_64Bytes       ((arm_reg_t)0x00000000)  /* threshold level of the MTL Receive FIFO is 64 Bytes */
#define ETH_DMAOMR_RTC_32Bytes       ((arm_reg_t)0x00000008)  /* threshold level of the MTL Receive FIFO is 32 Bytes */
#define ETH_DMAOMR_RTC_96Bytes       ((arm_reg_t)0x00000010)  /* threshold level of the MTL Receive FIFO is 96 Bytes */
#define ETH_DMAOMR_RTC_128Bytes      ((arm_reg_t)0x00000018)  /* threshold level of the MTL Receive FIFO is 128 Bytes */
#define ETH_DMAOMR_OSF               ((arm_reg_t)0x00000004)  /* operate on second frame */
#define ETH_DMAOMR_SR                ((arm_reg_t)0x00000002)  /* Start/stop receive */

/* Bit definition for Ethernet DMA Interrupt Enable Register */
#define ETH_DMAIER_NISE              ((arm_reg_t)0x00010000)  /* Normal interrupt summary enable */
#define ETH_DMAIER_AISE              ((arm_reg_t)0x00008000)  /* Abnormal interrupt summary enable */
#define ETH_DMAIER_ERIE              ((arm_reg_t)0x00004000)  /* Early receive interrupt enable */
#define ETH_DMAIER_FBEIE             ((arm_reg_t)0x00002000)  /* Fatal bus error interrupt enable */
#define ETH_DMAIER_ETIE              ((arm_reg_t)0x00000400)  /* Early transmit interrupt enable */
#define ETH_DMAIER_RWTIE             ((arm_reg_t)0x00000200)  /* Receive watchdog timeout interrupt enable */
#define ETH_DMAIER_RPSIE             ((arm_reg_t)0x00000100)  /* Receive process stopped interrupt enable */
#define ETH_DMAIER_RBUIE             ((arm_reg_t)0x00000080)  /* Receive buffer unavailable interrupt enable */
#define ETH_DMAIER_RIE               ((arm_reg_t)0x00000040)  /* Receive interrupt enable */
#define ETH_DMAIER_TUIE              ((arm_reg_t)0x00000020)  /* Transmit Underflow interrupt enable */
#define ETH_DMAIER_ROIE              ((arm_reg_t)0x00000010)  /* Receive Overflow interrupt enable */
#define ETH_DMAIER_TJTIE             ((arm_reg_t)0x00000008)  /* Transmit jabber timeout interrupt enable */
#define ETH_DMAIER_TBUIE             ((arm_reg_t)0x00000004)  /* Transmit buffer unavailable interrupt enable */
#define ETH_DMAIER_TPSIE             ((arm_reg_t)0x00000002)  /* Transmit process stopped interrupt enable */
#define ETH_DMAIER_TIE               ((arm_reg_t)0x00000001)  /* Transmit interrupt enable */

/* Bit definition for Ethernet DMA Missed Frame and Buffer Overflow Counter Register */
#define ETH_DMAMFBOCR_OFOC           ((arm_reg_t)0x10000000)  /* Overflow bit for FIFO overflow counter */
#define ETH_DMAMFBOCR_MFA            ((arm_reg_t)0x0FFE0000)  /* Number of frames missed by the application */
#define ETH_DMAMFBOCR_OMFC           ((arm_reg_t)0x00010000)  /* Overflow bit for missed frame counter */
#define ETH_DMAMFBOCR_MFC            ((arm_reg_t)0x0000FFFF)  /* Number of frames missed by the controller */

/* Bit definition for Ethernet DMA Current Host Transmit Descriptor Register */
#define ETH_DMACHTDR_HTDAP           ((arm_reg_t)0xFFFFFFFF)  /* Host transmit descriptor address pointer */

