ZhVladimir89/uos-embedded/sources/runtime/cortex-m/io-stm32f1.h
/* Bit definition for Ethernet DMA Current Host Receive Descriptor Register */
#define ETH_DMACHRDR_HRDAP           ((arm_reg_t)0xFFFFFFFF)  /* Host receive descriptor address pointer */

/* Bit definition for Ethernet DMA Current Host Transmit Buffer Address Register */
#define ETH_DMACHTBAR_HTBAP          ((arm_reg_t)0xFFFFFFFF)  /* Host transmit buffer address pointer */

/* Bit definition for Ethernet DMA Current Host Receive Buffer Address Register */
#define ETH_DMACHRBAR_HRBAP          ((arm_reg_t)0xFFFFFFFF)  /* Host receive buffer address pointer */
#endif /* STM32F10X_CL */

#define SET_BIT(REG, BIT)                    ((REG) |= (BIT))
#define CLEAR_BIT(REG, BIT)                  ((REG) &= ~(BIT))
#define READ_BIT(REG, BIT)                   ((REG) & (BIT))
#define CLEAR_REG(REG)                       ((REG) = (0x0))
#define WRITE_REG(REG, VAL)                  ((REG) = (VAL))
#define READ_REG(REG)                        ((REG))
#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))

#define PIN_SET(PORT,PIN)                    PORT->BSRR=(1<<PIN);
#define PIN_RESET(PORT,PIN)                  PORT->BSRR=(1<<(16+PIN));
#define PIN_IS_SET(PORT,PIN)                 (PORT->IDR&(1<<PIN))
#define PIN_INVERT(PORT,PIN)                 if(PORT->IDR&(1<<PIN)){PORT->BSRR=(1<<(16+PIN));}else{PORT->BSRR=(1<<PIN);}
#define RESET_GPIO(PORT)                     PORT->CRL = 0; PORT->CRH = 0; PORT->ODR=0; PORT->IDR=0

#endif /* _IO_STM32F1_H */
